Конфигурация/Documents/ПогашениеЦеннойБумаги.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>ПогашениеЦеннойБумаги</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ЗадолженностиПоДенежнымСредствам</xr:Item>
				<xr:Item>AccumulationRegister.ОстаткиЦенныхБумагЗаблокированные</xr:Item>
				<xr:Item>AccumulationRegister.БухПартииЦенныхБумагПроданныеВРепо</xr:Item>
				<xr:Item>AccountingRegister.БухгалтерскийУчет</xr:Item>
				<xr:Item>InformationRegister.ОперацииСЦеннымиБумагами</xr:Item>
				<xr:Item>AccountingRegister.ЕдиныйБухгалтерскийУчет</xr:Item>
				<xr:Item>AccumulationRegister.БухПартииЦенныхБумаг</xr:Item>
				<xr:Item>AccumulationRegister.БухПартииЦенныхБумагКупленныеПоРЕПО</xr:Item>
				<xr:Item>AccountingRegister.НалоговыйУчет</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Рынок</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РынкиЦенныхБумаг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦеннаяБумага</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиПогашаемые</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПогашения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыПогашения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаФиксации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Брокер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БрокерскиеКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетныйСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаОплаты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиКоличество</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаКупона</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОплатыПлановая</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Конфигурация/InformationRegisters/НоминалыЦенныхБумаг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>НоминалыЦенныхБумаг</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Номинал</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиНоминал</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПроцентОтНачальногоНоминала</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиЦенаПроцент</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаИзменения</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиНоминал</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВыплатыПлан</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВыплатыФакт</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаФиксации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРешения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ЦеннаяБумага</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Облигации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/InformationRegisters/РеквизитыПИФ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>РеквизитыПИФ</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>УправляющаяКомпания</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УправляющиеКомпании</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КраткоеНаименованиеФонда</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПолноеНаименованиеФонда</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ПаевойИнвестиционныйФонд</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПаевыеИнвестиционныеФонды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/Documents/ПогашениеЦеннойБумаги/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОБРАБОТЧИКИ_СОБЫТИЙ_ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не УниверсальныеМеханизмы.ПриСозданииФормыНаСервере(ЭтаФорма,,, Отказ) Тогда
		Возврат;
	КонецЕсли;
		
	ПриЧтенииСозданииНаСервере();
	
	Если Объект.Рынок = ПредопределенноеЗначение("Перечисление.РынкиЦенныхБумаг.Паи") Тогда
		ЭтаФорма.ЮрФизЛицоУКПИФ = ПолучитьЮрФизЛицоУКПИФ(Объект.ЦеннаяБумага, Объект.Дата);
	КонецЕсли;
	
	РаботаСФормами.ЗаполнитьДополнительныеСвязиИПараметрыВыбора(Элементы.Договор, "СчетДоверительногоУправления,ДатаРасторжения");
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	Если УниверсальныеМеханизмы.ФормаСоздана(ЭтаФорма) Тогда
		ПриЧтенииСозданииНаСервере();
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	УниверсальныеМеханизмы.УстановитьЗаголовокФормы(ЭтаФорма);
	
	ЗаполнитьПодтверждениеОперацииНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	РаботаСЖурналамиОперацийКлиентСервер.ОповеститьЖурналыОбИзменении();
	
	Оповестить("СводноеПогашениеОблигации.Обновить", Объект.Ссылка);
	
	РаботаСДокументамиКлиент.ПроверитьПараметрыПодтвержденияОперации(ЭтаФорма, Объект, ПараметрыЗаписи);

КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	Если ЭтаФорма.ОплатаЧерезБрокера = 1 Тогда
		ПроверяемыеРеквизиты.Добавить("Брокер");
	КонецЕсли;
	
	Если ЭтаФорма.ДетализацияПоРасчетномуСчету Тогда
		ПроверяемыеРеквизиты.Добавить("РасчетныйСчет");
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)

	Если ИмяСобытия = "ПодтверждениеОперации" Тогда
		Если Параметр = Объект.Ссылка
			ИЛИ (ТипЗнч(Параметр) = Тип("Массив") И Параметр.Найти(Объект.Ссылка) <> Неопределено)
		Тогда
			ЗаполнитьПодтверждениеОперацииНаСервере();
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОБРАБОТЧИКИ_СОБЫТИЙ_ЭЛЕМЕНТОВ_ШАПКИ_ФОРМЫ

&НаКлиенте
Процедура РынокПриИзменении(Элемент)
	
	Элементы.ЦеннаяБумага.ОграничениеТипа = РаботаСЦеннымиБумагамиКлиентСервер.ТипЦеннойБумагиВЗависимостиОтРынка(Объект.Рынок);
	
	ЗаполнитьСуммуНаОднуОблигацию(ЭтаФорма);
	
	Если Объект.Рынок <> ПредопределенноеЗначение("Перечисление.РынкиЦенныхБумаг.Облигации") Тогда
		Объект.СуммаКупона	= 0;
		Объект.ВидПогашения = ПредопределенноеЗначение("Перечисление.ВидыПогашения.ПолноеПогашение"); 
	КонецЕсли;
	
	НастроитьВидимостьИДоступность(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ЦеннаяБумагаПриИзменении(Элемент)
		
	ЭтаФорма.ВалютаНоминала = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.ЦеннаяБумага, "ВалютаНоминала");
		
	Если Не ЗначениеЗаполнено(Объект.ВалютаОплаты) Тогда
		Объект.ВалютаОплаты = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.ЦеннаяБумага, "ВалютаНоминала");
	КонецЕсли;
	
	ПересчетСуммы();
	
	Если Объект.Рынок = ПредопределенноеЗначение("Перечисление.РынкиЦенныхБумаг.Паи") Тогда
		ЭтаФорма.ЮрФизЛицоУКПИФ = ПолучитьЮрФизЛицоУКПИФ(Объект.ЦеннаяБумага, Объект.Дата);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	Объект.Дата = РаботаСДокументами.ПолучитьВремяДокумента(Объект.Дата, Объект.Ссылка);
	
	РаботаСДокументамиКлиент.ДетализацияПоРасчетномуСчетуПриИзмененииСвязанныхРеквизитов(ЭтаФорма);
	
	Если Не РаботаСИсполнителями.ЕстьИсполнитель(?(ЭтаФорма.ОплатаЧерезБрокера = 1, "ИсполнителиПоДенежнымСредствамБрокерские", "ИсполнителиПоДенежнымСредствамСобственные"),
		ОбщегоНазначенияКлиентСервер.ПоляВСтруктуру(Объект, "Дата, Организация, СчетДоверительногоУправления, Брокер, РасчетныйСчет"))
	Тогда
		Объект.РасчетныйСчет = Неопределено;
	КонецЕсли;
	
	ПересчетСуммы();
		
КонецПроцедуры

&НаКлиенте
Процедура ВидПогашенияПриИзменении(Элемент)
	
	Если Объект.ВидПогашения = ПредопределенноеЗначение("Перечисление.ВидыПогашения.ЧастичноеПогашение") Тогда
		Объект.СуммаКупона = 0;
	КонецЕсли;
	
	ПересчетСуммы();
	
	НастроитьВидимостьИДоступность(ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура ОплатаЧерезБрокераПриИзменении(Элемент)
		
	Если ЭтаФорма.ОплатаЧерезБрокера = 0 Тогда
		Объект.Брокер = Неопределено;
	КонецЕсли;
	
	Элементы.Брокер.Видимость = (ЭтаФорма.ОплатаЧерезБрокера = 1); 
	
	БрокерПриИзменении(Неопределено);
		
КонецПроцедуры

&НаКлиенте
Процедура БрокерПриИзменении(Элемент)
	
	РаботаСДокументамиКлиент.ДетализацияПоРасчетномуСчетуПриИзмененииСвязанныхРеквизитов(ЭтаФорма);
	
КонецПроцедуры 

&НаКлиенте
Процедура КоличествоПриИзменении(Элемент)
	
	ПересчетСуммы();

КонецПроцедуры

&НаКлиенте
Процедура СуммаПриИзменении(Элемент)
	
	Если Объект.ВидПогашения = ПредопределенноеЗначение("Перечисление.ВидыПогашения.Оферта") Тогда
		ЭтаФорма.СуммаНаОднуОблигацию = ?(Объект.Количество > 0, Объект.Сумма / Объект.Количество, 0);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДоговорНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(Объект.ЦеннаяБумага) Тогда 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Укажите ценную бумагу", Объект, "ЦеннаяБумага", "ЦеннаяБумага");
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РасчетныйСчетПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.РасчетныйСчет) Тогда
	
		ВалютаРасчетногоСчета = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.РасчетныйСчет, "Валюта");
		
		Если Объект.ВалютаОплаты <> ВалютаРасчетногоСчета Тогда
		
			Объект.ВалютаОплаты = ВалютаРасчетногоСчета;
		    ПересчетСуммы();
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВалютаОплатыОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	РаботаСДокументамиКлиент.СверитьВыбранноеЗначениеВалютыСВалютойРасчетногоСчета(ВыбранноеЗначение, Объект.ВалютаОплаты, Объект.РасчетныйСчет);
	Если Объект.ВалютаОплаты <> ВыбранноеЗначение Тогда
		Объект.ВалютаОплаты = ВыбранноеЗначение;
		ПересчетСуммы();
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

#Область ОБРАБОТЧИКИ_КОМАНД

&НаКлиенте
Процедура КомандаВыбратьИсполнителяПоДенежнымСредствам(Команда)
	
	РаботаСДокументамиКлиент.ВыбратьИсполнителяПоДенежнымСредствам(ЭтаФорма, ЭтаФорма.ОплатаЧерезБрокера);
	РасчетныйСчетПриИзменении(Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаРасчета(Команда)
	
	Если НЕ ТипЗнч(Объект.ЦеннаяБумага) = Тип("СправочникСсылка.Облигации") Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Расшифровка расчета доступна только для облигаций");
		Возврат;
	КонецЕсли; 
	
	СписокПартий = ПолучитьСписокПартий(Объект.Ссылка, Объект.СчетДоверительногоУправления, Объект.Организация, Объект.ЦеннаяБумага);
	
	Если СписокПартий.Количество() = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Нет движений по регистру ""Партии ценных бумаг""");
		Возврат;
	КонецЕсли;
	
	ЭлементСпискаПартий =  СписокПартий.ВыбратьЭлемент("Партия");
	
	Если ЭлементСпискаПартий <> Неопределено Тогда
		ПараметрыФормы = Новый Структура("ДатаПереоценки, Организация, СчетДоверительногоУправления, 
			|Количество, ОценочнаяСуммаКупона, ЦеннаяБумага, Партия, СтрокаПартии, УчетныйАктивЕПС, БалансовыйДисконт, Стоимость",
			Объект.Дата, 
			Объект.Организация, 
			Объект.СчетДоверительногоУправления, 
			ЭлементСпискаПартий.Значение.Количество, 
			0, // - купон уже погашен
			Объект.ЦеннаяБумага, 
			ЭлементСпискаПартий.Значение.Партия, 
			ЭлементСпискаПартий.Значение.СтрокаПартии,
			ЭлементСпискаПартий.Значение.УчетныйАктивЕПС,
			ЭлементСпискаПартий.Значение.БалансовыйДисконт,
			ЭлементСпискаПартий.Значение.Стоимость);
		ОткрытьФорму("Отчет.РасшифровкаРасчетаАмортизацииДисконтаПремииИКорректировкиПоЭСП.Форма.Форма", ПараметрыФормы, ЭтаФорма, ЭтаФорма,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца)
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСписокПартий(ПогашениеОблигации, СчетДоверительногоУправления, Организация, Облигация)
	
	СписокПартий = Новый СписокЗначений;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	БухПартииЦенныхБумаг.Партия КАК Партия,
		|	БухПартииЦенныхБумаг.СтрокаПартии КАК СтрокаПартии,
		|	БухПартииЦенныхБумаг.УчетныйАктивЕПС КАК УчетныйАктивЕПС,
		|	СУММА(БухПартииЦенныхБумагОстатки.КоличествоОстаток) КАК Количество,
		|	СУММА(БухПартииЦенныхБумагОстатки.ДисконтПремияНачисленныйОстаток) КАК ДисконтПремияНачисленный,
		|	СУММА(БухПартииЦенныхБумагОстатки.СтоимостьОстаток) КАК Стоимость
		|ИЗ
		|	РегистрНакопления.БухПартииЦенныхБумаг КАК БухПартииЦенныхБумаг
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.БухПартииЦенныхБумаг.Остатки(
		|				&Период,
		|				Организация = &Организация
		|					И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|					И ЦеннаяБумага = &ЦеннаяБумага
		|					И ВидУчета = ЗНАЧЕНИЕ(Перечисление.ВидыУчета.ЕдиныйБухгалтерскийУчет)) КАК БухПартииЦенныхБумагОстатки
		|		ПО БухПартииЦенныхБумаг.Партия = БухПартииЦенныхБумагОстатки.Партия
		|			И БухПартииЦенныхБумаг.СтрокаПартии = БухПартииЦенныхБумагОстатки.СтрокаПартии
		|			И БухПартииЦенныхБумаг.УчетныйАктивЕПС = БухПартииЦенныхБумагОстатки.УчетныйАктивЕПС
		|ГДЕ
		|	БухПартииЦенныхБумаг.Регистратор = &Регистратор
		|	И БухПартииЦенныхБумаг.ЦеннаяБумага = &ЦеннаяБумага
		|	И БухПартииЦенныхБумаг.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|	И БухПартииЦенныхБумаг.ВидУчета = ЗНАЧЕНИЕ(Перечисление.ВидыУчета.ЕдиныйБухгалтерскийУчет)
		|
		|СГРУППИРОВАТЬ ПО
		|	БухПартииЦенныхБумаг.СтрокаПартии,
		|	БухПартииЦенныхБумаг.ВидДвижения,
		|	БухПартииЦенныхБумаг.Партия,
		|	БухПартииЦенныхБумаг.УчетныйАктивЕПС";

	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("ЦеннаяБумага", Облигация);
	Запрос.УстановитьПараметр("Регистратор", ПогашениеОблигации);
	Запрос.УстановитьПараметр("Период", Новый Граница(ПогашениеОблигации.МоментВремени(), ВидГраницы.Исключая));

	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СписокПартий.Добавить(
			Новый Структура("Партия, СтрокаПартии, УчетныйАктивЕПС, Количество, БалансовыйДисконт, Стоимость", 
				Выборка.Партия, Выборка.СтрокаПартии, Выборка.УчетныйАктивЕПС, Выборка.Количество, Выборка.ДисконтПремияНачисленный, Выборка.Стоимость),
			Строка(Выборка.Партия) + ". Строка партии:" +  Выборка.СтрокаПартии);
	КонецЦикла;
	
	Возврат СписокПартий;
	
КонецФункции

#КонецОбласти

#Область СЛУЖЕБНЫЕ_ПРОЦЕДУРЫ_И_ФУНКЦИИ

&НаКлиентеНаСервереБезКонтекста
Процедура ЗаполнитьСуммуНаОднуОблигацию(Форма)
	
	Объект = Форма.Объект;
	
	Если Объект.Рынок = ПредопределенноеЗначение("Перечисление.РынкиЦенныхБумаг.Облигации") Тогда
		Если Объект.ВидПогашения = ПредопределенноеЗначение("Перечисление.ВидыПогашения.Оферта") Тогда
			Если Форма.СуммаНаОднуОблигацию = 0 И Объект.Сумма > 0 И Объект.Количество > 0 Тогда // по оферте сумму вводится вручную; расчет нужен только при создании/чтении формы
				Форма.СуммаНаОднуОблигацию = Объект.Сумма / Объект.Количество;
			КонецЕсли;
		Иначе
			Форма.СуммаНаОднуОблигацию = ?(ЗначениеЗаполнено(Объект.Дата) И ЗначениеЗаполнено(Объект.ЦеннаяБумага), СуммаВЗависимостиОтВидаПогашения(Объект.ЦеннаяБумага, Объект.Дата, Объект.ВидПогашения), 0);
		КонецЕсли;
	Иначе
		Форма.СуммаНаОднуОблигацию = 0;
	КонецЕсли;
	
КонецПроцедуры // ЗаполнитьСуммуНаОднуОблигацию

&НаКлиенте 
Процедура ПересчетСуммы()
	
	ЗаполнитьСуммуНаОднуОблигацию(ЭтаФорма);
		
	Объект.Сумма = РаботаСВалютами.ПересчетСуммыВВалюте(Объект.Количество * ЭтаФорма.СуммаНаОднуОблигацию, ВалютаНоминала, Объект.Дата, Объект.ВалютаОплаты, Объект.Дата);

КонецПроцедуры	

&НаСервереБезКонтекста 
Функция СуммаИзмененияНоминала(ДатаНоминала, ЦеннаяБумага)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	НоминалыЦенныхБумаг.СуммаИзменения
		|ИЗ
		|	РегистрСведений.НоминалыЦенныхБумаг КАК НоминалыЦенныхБумаг
		|ГДЕ
		|	НоминалыЦенныхБумаг.Период = &ДатаНоминала
		|	И НоминалыЦенныхБумаг.ЦеннаяБумага = &ЦеннаяБумага";

	Запрос.УстановитьПараметр("ДатаНоминала", ДатаНоминала);
	Запрос.УстановитьПараметр("ЦеннаяБумага", ЦеннаяБумага);

	РезультатЗапроса = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.СуммаИзменения;
	Иначе
		Возврат 0;
	КонецЕсли;
	
КонецФункции 

&НаСервереБезКонтекста
Функция СуммаВЗависимостиОтВидаПогашения(Облигация, Дата, ВидПогашения) 
	
	Если ВидПогашения = ПредопределенноеЗначение("Перечисление.ВидыПогашения.ЧастичноеПогашение") Тогда
		Возврат СуммаИзмененияНоминала(НачалоДня(Дата), Облигация);
	Иначе	
		Возврат РаботаСЦеннымиБумагами.ПолучитьНоминалИВалютуЦеннойБумаги(Облигация, НачалоДня(Дата)).Номинал;
	Конецесли;
	
КонецФункции 

&НаКлиентеНаСервереБезКонтекста
Процедура НастроитьВидимостьИДоступность(Форма)
	
	ДанныеОбъекта = Форма.Объект;
	Элементы      = Форма.Элементы;

	ЭтоРынокОблигаций	= (ДанныеОбъекта.Рынок = ПредопределенноеЗначение("Перечисление.РынкиЦенныхБумаг.Облигации"));
	ЭтоРынокПаев		= (ДанныеОбъекта.Рынок = ПредопределенноеЗначение("Перечисление.РынкиЦенныхБумаг.Паи"));
	
	Если ЭтоРынокОблигаций Тогда
		Элементы.ДатаФиксации.Видимость   			  = Истина;
		Элементы.ВидПогашения.Доступность   		  = Истина;
		Элементы.СуммаНаОднуОблигацию.Видимость       = Истина;
		Элементы.СуммаНаОднуОблигацию.ТолькоПросмотр  = (ДанныеОбъекта.ВидПогашения <> ПредопределенноеЗначение("Перечисление.ВидыПогашения.Оферта"));
		Элементы.СуммаКупона.Видимость                = (ДанныеОбъекта.ВидПогашения <> ПредопределенноеЗначение("Перечисление.ВидыПогашения.ЧастичноеПогашение"));
	Иначе
		Элементы.ДатаФиксации.Видимость   			  = Ложь;
		Элементы.ВидПогашения.Доступность   		  = Ложь;
		Элементы.СуммаНаОднуОблигацию.Видимость       = Ложь;
		Элементы.СуммаКупона.Видимость                = Ложь;
	КонецЕсли;	
	
	Элементы.ВидПогашения.Видимость = НЕ ЭтоРынокПаев;
	Элементы.Договор.Видимость 		= ЭтоРынокПаев;
	
	Элементы.Брокер.Видимость = (Форма.ОплатаЧерезБрокера = 1);
	
	// элементы, зависящие от детализации по р/с
	РаботаСДокументамиКлиентСервер.НастроитьВидимостьИДоступностьРасчетногоСчетаИСвязанныхРеквизитов(Форма);

КонецПроцедуры 	

&НаСервере
Процедура ПриЧтенииСозданииНаСервере()
	
	Элементы.ЦеннаяБумага.ОграничениеТипа = РаботаСЦеннымиБумагамиКлиентСервер.ТипЦеннойБумагиВЗависимостиОтРынка(Объект.Рынок);
	
	ЗаполнитьСуммуНаОднуОблигацию(ЭтаФорма);
	
	ЭтаФорма.ДетализацияПоРасчетномуСчету = РаботаСДокументами.ТребуетсяДетализацияПоРасчетномуСчету(Объект);
	ЭтаФорма.ОплатаЧерезБрокера           = ?(ЗначениеЗаполнено(Объект.Брокер), 1, 0);

	Если ЗначениеЗаполнено(Объект.ЦеннаяБумага) Тогда
		ЭтаФорма.ВалютаНоминала = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.ЦеннаяБумага, "ВалютаНоминала");
	КонецЕсли;
	
	НастроитьВидимостьИДоступность(ЭтаФорма);
	
	УниверсальныеМеханизмы.УстановитьЗаголовокФормы(ЭтаФорма);

КонецПроцедуры 	

&НаКлиенте
Процедура ПровестиПоБухгалтерскомуУчету()

	РаботаСФормамиКлиент.ПровестиПоБухгалтерскомуУчету(ЭтаФорма); 

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПодтверждениеОперацииНаСервере()

	РаботаСДокументами.ЗаполнитьПодтверждениеОперации(ЭтаФорма, Объект.Ссылка);		

КонецПроцедуры

&НаКлиенте
Процедура СчетДоверительногоУправленияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	РаботаСДокументамиКлиент.СчетДоверительногоУправленияОбработкаВыбора(Объект, ЭтаФорма, ВыбранноеЗначение, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	РаботаСДокументамиКлиент.ДатаОбработкаВыбора(Объект, ЭтаФорма, ВыбранноеЗначение, СтандартнаяОбработка);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьЮрФизЛицоУКПИФ(Пай, Период)
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Пай",	Пай);
	Запрос.УстановитьПараметр("Период",	Период);
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РеквизитыПИФСрезПоследних.УправляющаяКомпания.ЮрФизЛицо КАК ЮрФизЛицоУКПИФ
		|ИЗ
		|	Справочник.Паи КАК Паи
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыПИФ.СрезПоследних(&Период, ) КАК РеквизитыПИФСрезПоследних
		|		ПО Паи.ПаевойИнвестиционныйФонд = РеквизитыПИФСрезПоследних.ПаевойИнвестиционныйФонд
		|ГДЕ
		|	Паи.Ссылка = &Пай";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ЮрФизЛицоУКПИФ;
	Иначе
		Возврат Справочники.ЮрФизЛица.ПустаяСсылка();
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура РасшифровкаРасчетаСС(Команда)
	
	Если Не ЗначениеЗаполнено(Объект.ЦеннаяБумага) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Нет данных для расшифровки", , , "ЦеныПереоценкиСписок");
		Возврат;
	КонецЕсли;
	
	// Проверяем, что заведены настройки оценки, и подгружаем файл с оценочной стоимостью, предоставленной клиентом
	Если БухгалтерскийУчет.ВедетсяУчетЕПС(Объект.Дата, Объект.Организация, Объект.СчетДоверительногоУправления) Тогда
		ВидУчета = ПредопределенноеЗначение("Справочник.ЦелиРасчета.ЕдиныйПланСчетов");
	Иначе
		ВидУчета = ПредопределенноеЗначение("Справочник.ЦелиРасчета.БухгалтерскийУчет"); 
	КонецЕсли;
	
	Отказ						= Ложь;
 	ДанныеЕПС					= Истина;
	НастройкиОценки				= РаботаСПереоценкой.ОпределитьНастройкиОценки(Объект.Дата, Объект.Организация, Объект.СчетДоверительногоУправления, ВидУчета, Истина);
	ВыполнятьРасчетПоУказаниюЦБ	= НастройкиОценки.ВыполнятьРасчетПоУказаниюЦБ5419 ИЛИ НастройкиОценки.ВыполнятьРасчетПоПисьмуЦБ0185316;
	АдресТаблицыСтоимостей		= Неопределено;
	
	Если Не ЗначениеЗаполнено(НастройкиОценки.ВариантРасчетаОценочнойСтоимости) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не определен вариант оценки для цели '" + Строка(ВидУчета) + "'", , , , Отказ);
	ИначеЕсли НастройкиОценки.ВариантРасчетаОценочнойСтоимости = ПредопределенноеЗначение("Справочник.ВариантыРасчетаОценочнойСтоимости.ПредоставленаКлиентом") Тогда
		АдресТаблицыСтоимостей = РаботаСВнешнимиСистемамиКлиентСервер.ПоместитьФайлОценочнойСтоимостиПредоставленнойКлиентомВоВременноеХранилище(
			Объект.СчетДоверительногоУправления, Объект.Дата, ДанныеЕПС, ЭтаФорма.УникальныйИдентификатор, Отказ);
		Отказ = Отказ И Не ВыполнятьРасчетПоУказаниюЦБ; // Если оценка "заморожена", то актуальные цены от клиента не нужны
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	// Формируем расшифровку расчета
	
	Ошибки				= Неопределено;
	РасшифровкаРасчета	= Неопределено;
	
	ПараметрыПереоценки	= Новый Структура("Организация, СчетДоверительногоУправления, ВидУчета, Дата");
	ЗаполнитьЗначенияСвойств(ПараметрыПереоценки, Объект);
	ПараметрыПереоценки.Вставить("ЦельРасчета", ПредопределенноеЗначение("Справочник.ЦелиРасчета.ЕдиныйПланСчетов")); 
	
	Если РаботаСДокументами.СформироватьРасшифровкуРасчетаСтоимостиЦеннойБумаги(РасшифровкаРасчета, ПараметрыПереоценки, Объект.ЦеннаяБумага, НастройкиОценки.ВариантРасчетаОценочнойСтоимости, АдресТаблицыСтоимостей, Ошибки) Тогда
		РасшифровкаРасчета.Показать("Расчет стоимости '" + Строка(Объект.ЦеннаяБумага) + "'");		
	ИначеЕсли Ошибки.Количество() = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Расшифровка расчета стоимости для варианта '" + НастройкиОценки.ВариантРасчетаОценочнойСтоимости + "' не реализована");	
	Иначе
		ТекстОшибки = "Ошибка получения расшифровки расчета:" + Символы.ПС + СтрСоединить(Ошибки, Символы.ПС);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
